{
  "date": "2020-11-06T05:47:27.930Z",
  "title": "OGB's Complete Draft Guide for the 2020 Fantasy Football Season",
  "body": "## Download: FREE 2020 Fantasy Football Rankings\n\nCheck out the spreadsheet below for a FREE download of my NFL Top 300 Fantasy Football rankings for the upcoming 2020 season. Leave a comment down below and let me know your thoughts!DOWNLOAD: FREE 2020 FANTASY FOOTBALL RANKINGS\n\n![The OGB Sports Battlestation](/img/image110-1024x768.webp \"The OGB Sports Battlestation\")\n\n## Diamond in the Back: Top Rookies / Sophomores who could take your team to the next level in 2020\n\nSo everybody knows about your Barkley’s and your McCaffrey’s, but what about the newcomers . There is always a lot of talent coming up every year through the draft process, some of those guys hit the ground running right out of the gate. There can be a couple of ways to tell if a rookie is ready to perform, by his level of maturity, or by the team’s lack of options, therefore vaulting them into starter status. This list is going to have them all. Rookies should not be taken lightly either. Most of them will go in the later part of your draft, except a specific few, with the likes of Clyde Edwards-Helaire, and Jonathan Taylor. Needless to say, you can find a ton of value in players that have yet to establish themselves in the league. So even though they might not have quite the high floor yet, the sky is the limit. So lets get started with my first player on the list.\n\n**Joe Burrow QB CIN-** He’s no stranger to the limelight, winning theNational Championship and the Heismen Trophy in 2019. He also threw for 60 touchdown passes (FBS single season record) to go along with 5,600 yards passing, so yeah, the kid can ball. He’ll be stepping into a young Bengals offense with the likes of Joe Mixon, Tyler Boyd, Tee Higgins, and John Ross III all at his disposal. To top it off He’ll have veteran A.J. Green who is fully fit this year and ready to prove he’s still got it. But wait! There’s more. Andy Dalton aka “The Red Rocket” has left the team after being they’re starter for 9 years, which leaves it wide open for Burrow to get a long leash to prove himself.\n\n**Gardner Minshew QB JAX-** Was a sixth round pick by the Jaguars in ’19. He stepped into the starters roll last year when quarterback Nick Foles went down with a broken clavicle in the first game. His long flowing hair and pornstache took the league by storm and set a bunch of Jag’s rookie records in the process. Now, a year later, Foles is gone and this is Minshew’s team to lose.\n\n**Drew Lock QB DEN-** He started the last five games for the Broncos last year and proved enough of his worth for them to start building a team around their 2019 second round pick. Lock held his own last year with a 89.7 QB rating and a completion percentage of 64%. Elway and company have spent a lot of their off-season trying to improve the offense around him by trading for running back Melvin Gordon and drafting wide receiver Jerry Juedy out of Alabama with their first round pick in the 2020 draft. If Drew Lock can take another step forward this year, he could prove to be a very valuable asset on any fantasy team.\n\n**Terry McLaurin WR WAS-** He vaulted onto the scenes last year with 58 receptions, 919 receiving yards and 7 touchdowns as a rookie who also had to deal with inconsistent quarterback play. As Dwayne Haskins’ primary receiver Scary Terry is going to see a lot of volume in a young “Football Team” offense that will probably be playing from behind much of the year.\n\n**Marquise Brown WR BAL-** Hollywood Brown displayed some world class speed last year, and if he can improve his connection with fellow teammate Lamar Jackson he’ll have a bright future ahead of him. On top of his speed he also added 23 lbs this off-season which should definitely have an impact on his skills at the line separating from NFL caliber defensive backs who spent a good amount of time last year stifling his route running. He was a little up-and-down last year with only 584 receiving yards, but he did have 7 touchdowns. If he can make a decent leap and improve upon last year’s success Smiley Face aka Lamar Jackson will have a big smile on his face next year with Hollywood Brown as his number wide out.\n\n**Darius Slayton WR NYG-** Drafted by the Giants in the fifth round of the 2019 draft Slayton had a very productive rookie year finishing with a stat line of 48 receptions, 740 yards, and 8 touchdowns. With fellow teammate Daniel Jones coming into his own last year, Saquon Barkley just being himself, and an improved Giants team, Slayton could be poised to take it to the next level this year.\n\n**Preston Williams WR MIA-** He signed with the Dolphins last year in May as a free agent and made the final 53 man roster after going undrafted in the 2019 draft. His rookie year was cut short because of a season ending ACL tear, but that wasn’t before catching 3 touchdowns to go along with 32 receptions and 428 receiving yards in 9 weeks. Two of his fellow teammates (Allen Hurns and Albert Wilson) have already opted out of the 2020 season opening up the door for Williams. Early reports from training camp are he’s been really impressive so far and if he can bounce back from a tough injury in his rookie year, Preston is going to help a lot of fantasy teams this year.\n\n**Henry Ruggs III WR LV-** He was a three sport athlete in high school and the fastest player at the NFL combine this year, so we all know this guy has some talent. Given the lack of depth at the wide receiver position on this Raiders squad he has a very good opportunity to be the number one guy for Derrick Carr (or Marcus Mariota) right out of the gate. In his three years at Alabama he had 98 catches for 1,716 and 24 touchdowns. He is going to be a big play guy similar to Tyreek Hill, so keep your eye on him this season.\n\n**Jerry Juedy WR DEN-** He was drafted in the first round of this years draft by the Denver Broncos, just like fellow Alabama teammate Ruggs who was mentioned above. He was awarded the **Fred Biletnikoff Award** as the nations best wide receiver as a sophomore in ’18. He had a very productive college career over his three years at Alabama finishing with a stat line of 159 receptions 2,742 yards and 26 touchdowns. He will have a hard time beating out Courtland Sutton for the starting job, but he should have a clear path to being Drew Lock’s second favorite weapon.\n\n**D’Andre Swift RB DET-** Drafted by the Lions with the third pick in the second round Swift has tremendous talent. His last two years at Georgia he combined 2,900 all purpose yards and 17 touchdowns while having back to back 1,000 yard rushing seasons. He steps into a Detroit squad that has had some major issues at the running back spot over the years with injuries and inconsistent play. Swift has a great chance to fight for the top spot and he’s shown he has the skills to be a three down back.\n\n**Cam Akers RB LAR-** He was drafted by the LA Rams in the second round of the draft this year, and he joins a team that just said dueces to Pro Bowler Todd Gurley, which might be able to clear up some first team reps for this rookie out of Florida State. In his three years at Florida State he combined for 3,400 all purpose yards and 27 touchdowns. He will have some competition in Malcolm Brown and Darrell Henderson, but he has a good training camp and earns the trust of Sean McVay the sky is the limit for this former Nole.\n\n**Noah Fant TE DEN-** Had a terrific rookie season with the Broncos bringing home a stat line of 40 receptions 562 yards and 3 touchdowns. Drew Lock will have a lot of weapons to work with this year, but given the connection that he and Fant had last year I see a nice second year leap for this talented tight end out of Iowa.",
  "description": "Get the latest on all your favorite players "
}